In [1]:
import pandas as pd

In [10]:
# states_dicts = [{"STATE": "New Jersey", "ABBREVIATION": "NJ"},
#                 {"STATE": "New York", "ABBREVIATION": "NY"}]

student1 = {"students": "Joon Yoo", "initials": "JY"}
student2 = {"students": "Steve Jobs", "initials": "SJ"}

In [28]:
student_dict = [{"students": "Joon Yoo", "initials": {"JY","Punk Kid"  }} 
                , {"students": "Steve Jobs", "initials": "SJ"}
               ,{"students": "Paula Stevens", "initials": "PS"}]

In [29]:
students_df = pd.DataFrame(student_dict)

In [30]:
students_df

         initials       students
0  {JY, Punk Kid}       Joon Yoo
1              SJ     Steve Jobs
2              PS  Paula Stevens

In [31]:
new_df = pd.DataFrame( [{"students": "Joon Yoo", "initials": {"JY","Punk Kid"  }} 
                , {"students": "Steve Jobs", "initials": "SJ"}
               ,{"students": "Paula Stevens", "initials": "PS"}])

In [32]:
new_df

         initials       students
0  {JY, Punk Kid}       Joon Yoo
1              SJ     Steve Jobs
2              PS  Paula Stevens